GopalSaraf/Practicals/PSDL/include/proc/pic16f1709.inc
// Register: PWM4DCH
#define PWM4DCH PWM4DCH
PWM4DCH                                  equ 061Bh
// bitfield definitions
PWM4DCH_PWM4DCH_POSN                     equ 0000h
PWM4DCH_PWM4DCH_POSITION                 equ 0000h
PWM4DCH_PWM4DCH_SIZE                     equ 0008h
PWM4DCH_PWM4DCH_LENGTH                   equ 0008h
PWM4DCH_PWM4DCH_MASK                     equ 00FFh
PWM4DCH_PWM4DCH0_POSN                    equ 0000h
PWM4DCH_PWM4DCH0_POSITION                equ 0000h
PWM4DCH_PWM4DCH0_SIZE                    equ 0001h
PWM4DCH_PWM4DCH0_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH0_MASK                    equ 0001h
PWM4DCH_PWM4DCH1_POSN                    equ 0001h
PWM4DCH_PWM4DCH1_POSITION                equ 0001h
PWM4DCH_PWM4DCH1_SIZE                    equ 0001h
PWM4DCH_PWM4DCH1_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH1_MASK                    equ 0002h
PWM4DCH_PWM4DCH2_POSN                    equ 0002h
PWM4DCH_PWM4DCH2_POSITION                equ 0002h
PWM4DCH_PWM4DCH2_SIZE                    equ 0001h
PWM4DCH_PWM4DCH2_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH2_MASK                    equ 0004h
PWM4DCH_PWM4DCH3_POSN                    equ 0003h
PWM4DCH_PWM4DCH3_POSITION                equ 0003h
PWM4DCH_PWM4DCH3_SIZE                    equ 0001h
PWM4DCH_PWM4DCH3_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH3_MASK                    equ 0008h
PWM4DCH_PWM4DCH4_POSN                    equ 0004h
PWM4DCH_PWM4DCH4_POSITION                equ 0004h
PWM4DCH_PWM4DCH4_SIZE                    equ 0001h
PWM4DCH_PWM4DCH4_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH4_MASK                    equ 0010h
PWM4DCH_PWM4DCH5_POSN                    equ 0005h
PWM4DCH_PWM4DCH5_POSITION                equ 0005h
PWM4DCH_PWM4DCH5_SIZE                    equ 0001h
PWM4DCH_PWM4DCH5_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH5_MASK                    equ 0020h
PWM4DCH_PWM4DCH6_POSN                    equ 0006h
PWM4DCH_PWM4DCH6_POSITION                equ 0006h
PWM4DCH_PWM4DCH6_SIZE                    equ 0001h
PWM4DCH_PWM4DCH6_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH6_MASK                    equ 0040h
PWM4DCH_PWM4DCH7_POSN                    equ 0007h
PWM4DCH_PWM4DCH7_POSITION                equ 0007h
PWM4DCH_PWM4DCH7_SIZE                    equ 0001h
PWM4DCH_PWM4DCH7_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH7_MASK                    equ 0080h

// Register: PWM4CON
#define PWM4CON PWM4CON
PWM4CON                                  equ 061Ch
// bitfield definitions
PWM4CON_PWM4POL_POSN                     equ 0004h
PWM4CON_PWM4POL_POSITION                 equ 0004h
PWM4CON_PWM4POL_SIZE                     equ 0001h
PWM4CON_PWM4POL_LENGTH                   equ 0001h
PWM4CON_PWM4POL_MASK                     equ 0010h
PWM4CON_PWM4OUT_POSN                     equ 0005h
PWM4CON_PWM4OUT_POSITION                 equ 0005h
PWM4CON_PWM4OUT_SIZE                     equ 0001h
PWM4CON_PWM4OUT_LENGTH                   equ 0001h
PWM4CON_PWM4OUT_MASK                     equ 0020h
PWM4CON_PWM4EN_POSN                      equ 0007h
PWM4CON_PWM4EN_POSITION                  equ 0007h
PWM4CON_PWM4EN_SIZE                      equ 0001h
PWM4CON_PWM4EN_LENGTH                    equ 0001h
PWM4CON_PWM4EN_MASK                      equ 0080h

// Register: COG1PHR
#define COG1PHR COG1PHR
COG1PHR                                  equ 0691h
// bitfield definitions
COG1PHR_G1PHR_POSN                       equ 0000h
COG1PHR_G1PHR_POSITION                   equ 0000h
COG1PHR_G1PHR_SIZE                       equ 0006h
COG1PHR_G1PHR_LENGTH                     equ 0006h
COG1PHR_G1PHR_MASK                       equ 003Fh
COG1PHR_G1PHR0_POSN                      equ 0000h
COG1PHR_G1PHR0_POSITION                  equ 0000h
COG1PHR_G1PHR0_SIZE                      equ 0001h
COG1PHR_G1PHR0_LENGTH                    equ 0001h
COG1PHR_G1PHR0_MASK                      equ 0001h
COG1PHR_G1PHR1_POSN                      equ 0001h
COG1PHR_G1PHR1_POSITION                  equ 0001h
COG1PHR_G1PHR1_SIZE                      equ 0001h
COG1PHR_G1PHR1_LENGTH                    equ 0001h
COG1PHR_G1PHR1_MASK                      equ 0002h
COG1PHR_G1PHR2_POSN                      equ 0002h
COG1PHR_G1PHR2_POSITION                  equ 0002h
COG1PHR_G1PHR2_SIZE                      equ 0001h
COG1PHR_G1PHR2_LENGTH                    equ 0001h
COG1PHR_G1PHR2_MASK                      equ 0004h
COG1PHR_G1PHR3_POSN                      equ 0003h
COG1PHR_G1PHR3_POSITION                  equ 0003h
COG1PHR_G1PHR3_SIZE                      equ 0001h
COG1PHR_G1PHR3_LENGTH                    equ 0001h
COG1PHR_G1PHR3_MASK                      equ 0008h
COG1PHR_G1PHR4_POSN                      equ 0004h
COG1PHR_G1PHR4_POSITION                  equ 0004h
COG1PHR_G1PHR4_SIZE                      equ 0001h
COG1PHR_G1PHR4_LENGTH                    equ 0001h
COG1PHR_G1PHR4_MASK                      equ 0010h
COG1PHR_G1PHR5_POSN                      equ 0005h
COG1PHR_G1PHR5_POSITION                  equ 0005h
COG1PHR_G1PHR5_SIZE                      equ 0001h
COG1PHR_G1PHR5_LENGTH                    equ 0001h
COG1PHR_G1PHR5_MASK                      equ 0020h

// Register: COG1PHF
#define COG1PHF COG1PHF
COG1PHF                                  equ 0692h
// bitfield definitions
COG1PHF_G1PHF_POSN                       equ 0000h
COG1PHF_G1PHF_POSITION                   equ 0000h
COG1PHF_G1PHF_SIZE                       equ 0006h
COG1PHF_G1PHF_LENGTH                     equ 0006h
COG1PHF_G1PHF_MASK                       equ 003Fh
COG1PHF_G1PHF0_POSN                      equ 0000h
COG1PHF_G1PHF0_POSITION                  equ 0000h
COG1PHF_G1PHF0_SIZE                      equ 0001h
COG1PHF_G1PHF0_LENGTH                    equ 0001h
COG1PHF_G1PHF0_MASK                      equ 0001h
COG1PHF_G1PHF1_POSN                      equ 0001h
COG1PHF_G1PHF1_POSITION                  equ 0001h
COG1PHF_G1PHF1_SIZE                      equ 0001h
COG1PHF_G1PHF1_LENGTH                    equ 0001h
COG1PHF_G1PHF1_MASK                      equ 0002h
COG1PHF_G1PHF2_POSN                      equ 0002h
COG1PHF_G1PHF2_POSITION                  equ 0002h
COG1PHF_G1PHF2_SIZE                      equ 0001h
COG1PHF_G1PHF2_LENGTH                    equ 0001h
COG1PHF_G1PHF2_MASK                      equ 0004h
COG1PHF_G1PHF3_POSN                      equ 0003h
COG1PHF_G1PHF3_POSITION                  equ 0003h
COG1PHF_G1PHF3_SIZE                      equ 0001h
COG1PHF_G1PHF3_LENGTH                    equ 0001h
COG1PHF_G1PHF3_MASK                      equ 0008h
COG1PHF_G1PHF4_POSN                      equ 0004h
COG1PHF_G1PHF4_POSITION                  equ 0004h
COG1PHF_G1PHF4_SIZE                      equ 0001h
COG1PHF_G1PHF4_LENGTH                    equ 0001h
COG1PHF_G1PHF4_MASK                      equ 0010h
COG1PHF_G1PHF5_POSN                      equ 0005h
COG1PHF_G1PHF5_POSITION                  equ 0005h
COG1PHF_G1PHF5_SIZE                      equ 0001h
COG1PHF_G1PHF5_LENGTH                    equ 0001h
COG1PHF_G1PHF5_MASK                      equ 0020h

