GopalSaraf/Practicals/PSDL/include/proc/pic16f1709.inc
// Register: COG1ASD0
#define COG1ASD0 COG1ASD0
COG1ASD0                                 equ 069Dh
// bitfield definitions
COG1ASD0_G1ASDAC_POSN                    equ 0002h
COG1ASD0_G1ASDAC_POSITION                equ 0002h
COG1ASD0_G1ASDAC_SIZE                    equ 0002h
COG1ASD0_G1ASDAC_LENGTH                  equ 0002h
COG1ASD0_G1ASDAC_MASK                    equ 000Ch
COG1ASD0_G1ASDBD_POSN                    equ 0004h
COG1ASD0_G1ASDBD_POSITION                equ 0004h
COG1ASD0_G1ASDBD_SIZE                    equ 0002h
COG1ASD0_G1ASDBD_LENGTH                  equ 0002h
COG1ASD0_G1ASDBD_MASK                    equ 0030h
COG1ASD0_G1ARSEN_POSN                    equ 0006h
COG1ASD0_G1ARSEN_POSITION                equ 0006h
COG1ASD0_G1ARSEN_SIZE                    equ 0001h
COG1ASD0_G1ARSEN_LENGTH                  equ 0001h
COG1ASD0_G1ARSEN_MASK                    equ 0040h
COG1ASD0_G1ASE_POSN                      equ 0007h
COG1ASD0_G1ASE_POSITION                  equ 0007h
COG1ASD0_G1ASE_SIZE                      equ 0001h
COG1ASD0_G1ASE_LENGTH                    equ 0001h
COG1ASD0_G1ASE_MASK                      equ 0080h
COG1ASD0_G1ASDAC0_POSN                   equ 0002h
COG1ASD0_G1ASDAC0_POSITION               equ 0002h
COG1ASD0_G1ASDAC0_SIZE                   equ 0001h
COG1ASD0_G1ASDAC0_LENGTH                 equ 0001h
COG1ASD0_G1ASDAC0_MASK                   equ 0004h
COG1ASD0_G1ASDAC1_POSN                   equ 0003h
COG1ASD0_G1ASDAC1_POSITION               equ 0003h
COG1ASD0_G1ASDAC1_SIZE                   equ 0001h
COG1ASD0_G1ASDAC1_LENGTH                 equ 0001h
COG1ASD0_G1ASDAC1_MASK                   equ 0008h
COG1ASD0_G1ASDBD0_POSN                   equ 0004h
COG1ASD0_G1ASDBD0_POSITION               equ 0004h
COG1ASD0_G1ASDBD0_SIZE                   equ 0001h
COG1ASD0_G1ASDBD0_LENGTH                 equ 0001h
COG1ASD0_G1ASDBD0_MASK                   equ 0010h
COG1ASD0_G1ASDBD1_POSN                   equ 0005h
COG1ASD0_G1ASDBD1_POSITION               equ 0005h
COG1ASD0_G1ASDBD1_SIZE                   equ 0001h
COG1ASD0_G1ASDBD1_LENGTH                 equ 0001h
COG1ASD0_G1ASDBD1_MASK                   equ 0020h

// Register: COG1ASD1
#define COG1ASD1 COG1ASD1
COG1ASD1                                 equ 069Eh
// bitfield definitions
COG1ASD1_G1AS0E_POSN                     equ 0000h
COG1ASD1_G1AS0E_POSITION                 equ 0000h
COG1ASD1_G1AS0E_SIZE                     equ 0001h
COG1ASD1_G1AS0E_LENGTH                   equ 0001h
COG1ASD1_G1AS0E_MASK                     equ 0001h
COG1ASD1_G1AS1E_POSN                     equ 0001h
COG1ASD1_G1AS1E_POSITION                 equ 0001h
COG1ASD1_G1AS1E_SIZE                     equ 0001h
COG1ASD1_G1AS1E_LENGTH                   equ 0001h
COG1ASD1_G1AS1E_MASK                     equ 0002h
COG1ASD1_G1AS2E_POSN                     equ 0002h
COG1ASD1_G1AS2E_POSITION                 equ 0002h
COG1ASD1_G1AS2E_SIZE                     equ 0001h
COG1ASD1_G1AS2E_LENGTH                   equ 0001h
COG1ASD1_G1AS2E_MASK                     equ 0004h
COG1ASD1_G1AS3E_POSN                     equ 0003h
COG1ASD1_G1AS3E_POSITION                 equ 0003h
COG1ASD1_G1AS3E_SIZE                     equ 0001h
COG1ASD1_G1AS3E_LENGTH                   equ 0001h
COG1ASD1_G1AS3E_MASK                     equ 0008h

// Register: COG1STR
#define COG1STR COG1STR
COG1STR                                  equ 069Fh
// bitfield definitions
COG1STR_G1STRA_POSN                      equ 0000h
COG1STR_G1STRA_POSITION                  equ 0000h
COG1STR_G1STRA_SIZE                      equ 0001h
COG1STR_G1STRA_LENGTH                    equ 0001h
COG1STR_G1STRA_MASK                      equ 0001h
COG1STR_G1STRB_POSN                      equ 0001h
COG1STR_G1STRB_POSITION                  equ 0001h
COG1STR_G1STRB_SIZE                      equ 0001h
COG1STR_G1STRB_LENGTH                    equ 0001h
COG1STR_G1STRB_MASK                      equ 0002h
COG1STR_G1STRC_POSN                      equ 0002h
COG1STR_G1STRC_POSITION                  equ 0002h
COG1STR_G1STRC_SIZE                      equ 0001h
COG1STR_G1STRC_LENGTH                    equ 0001h
COG1STR_G1STRC_MASK                      equ 0004h
COG1STR_G1STRD_POSN                      equ 0003h
COG1STR_G1STRD_POSITION                  equ 0003h
COG1STR_G1STRD_SIZE                      equ 0001h
COG1STR_G1STRD_LENGTH                    equ 0001h
COG1STR_G1STRD_MASK                      equ 0008h
COG1STR_G1SDATA_POSN                     equ 0004h
COG1STR_G1SDATA_POSITION                 equ 0004h
COG1STR_G1SDATA_SIZE                     equ 0001h
COG1STR_G1SDATA_LENGTH                   equ 0001h
COG1STR_G1SDATA_MASK                     equ 0010h
COG1STR_G1SDATB_POSN                     equ 0005h
COG1STR_G1SDATB_POSITION                 equ 0005h
COG1STR_G1SDATB_SIZE                     equ 0001h
COG1STR_G1SDATB_LENGTH                   equ 0001h
COG1STR_G1SDATB_MASK                     equ 0020h
COG1STR_G1SDATC_POSN                     equ 0006h
COG1STR_G1SDATC_POSITION                 equ 0006h
COG1STR_G1SDATC_SIZE                     equ 0001h
COG1STR_G1SDATC_LENGTH                   equ 0001h
COG1STR_G1SDATC_MASK                     equ 0040h
COG1STR_G1SDATD_POSN                     equ 0007h
COG1STR_G1SDATD_POSITION                 equ 0007h
COG1STR_G1SDATD_SIZE                     equ 0001h
COG1STR_G1SDATD_LENGTH                   equ 0001h
COG1STR_G1SDATD_MASK                     equ 0080h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 0E0Fh
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: INTPPS
#define INTPPS INTPPS
INTPPS                                   equ 0E10h
// bitfield definitions
INTPPS_INTPPS_POSN                       equ 0000h
INTPPS_INTPPS_POSITION                   equ 0000h
INTPPS_INTPPS_SIZE                       equ 0005h
INTPPS_INTPPS_LENGTH                     equ 0005h
INTPPS_INTPPS_MASK                       equ 001Fh

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 0E11h
// bitfield definitions
T0CKIPPS_T0CKIPPS_POSN                   equ 0000h
T0CKIPPS_T0CKIPPS_POSITION               equ 0000h
T0CKIPPS_T0CKIPPS_SIZE                   equ 0005h
T0CKIPPS_T0CKIPPS_LENGTH                 equ 0005h
T0CKIPPS_T0CKIPPS_MASK                   equ 001Fh

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 0E12h
// bitfield definitions
T1CKIPPS_T1CKIPPS_POSN                   equ 0000h
T1CKIPPS_T1CKIPPS_POSITION               equ 0000h
T1CKIPPS_T1CKIPPS_SIZE                   equ 0005h
T1CKIPPS_T1CKIPPS_LENGTH                 equ 0005h
T1CKIPPS_T1CKIPPS_MASK                   equ 001Fh

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 0E13h
// bitfield definitions
T1GPPS_T1GPPS_POSN                       equ 0000h
T1GPPS_T1GPPS_POSITION                   equ 0000h
T1GPPS_T1GPPS_SIZE                       equ 0005h
T1GPPS_T1GPPS_LENGTH                     equ 0005h
T1GPPS_T1GPPS_MASK                       equ 001Fh

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
CCP1PPS                                  equ 0E14h
// bitfield definitions
CCP1PPS_CCP1PPS_POSN                     equ 0000h
CCP1PPS_CCP1PPS_POSITION                 equ 0000h
CCP1PPS_CCP1PPS_SIZE                     equ 0005h
CCP1PPS_CCP1PPS_LENGTH                   equ 0005h
CCP1PPS_CCP1PPS_MASK                     equ 001Fh

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
CCP2PPS                                  equ 0E15h
// bitfield definitions
CCP2PPS_CCP2PPS_POSN                     equ 0000h
CCP2PPS_CCP2PPS_POSITION                 equ 0000h
CCP2PPS_CCP2PPS_SIZE                     equ 0005h
CCP2PPS_CCP2PPS_LENGTH                   equ 0005h
CCP2PPS_CCP2PPS_MASK                     equ 001Fh

// Register: COGINPPS
#define COGINPPS COGINPPS
COGINPPS                                 equ 0E17h
// bitfield definitions
COGINPPS_COGINPPS_POSN                   equ 0000h
COGINPPS_COGINPPS_POSITION               equ 0000h
COGINPPS_COGINPPS_SIZE                   equ 0005h
COGINPPS_COGINPPS_LENGTH                 equ 0005h
COGINPPS_COGINPPS_MASK                   equ 001Fh

// Register: SSPCLKPPS
#define SSPCLKPPS SSPCLKPPS
SSPCLKPPS                                equ 0E20h
// bitfield definitions
SSPCLKPPS_SSPCLKPPS_POSN                 equ 0000h
SSPCLKPPS_SSPCLKPPS_POSITION             equ 0000h
SSPCLKPPS_SSPCLKPPS_SIZE                 equ 0005h
SSPCLKPPS_SSPCLKPPS_LENGTH               equ 0005h
SSPCLKPPS_SSPCLKPPS_MASK                 equ 001Fh

// Register: SSPDATPPS
#define SSPDATPPS SSPDATPPS
SSPDATPPS                                equ 0E21h
// bitfield definitions
SSPDATPPS_SSPDATPPS_POSN                 equ 0000h
SSPDATPPS_SSPDATPPS_POSITION             equ 0000h
SSPDATPPS_SSPDATPPS_SIZE                 equ 0005h
SSPDATPPS_SSPDATPPS_LENGTH               equ 0005h
SSPDATPPS_SSPDATPPS_MASK                 equ 001Fh

// Register: SSPSSPPS
#define SSPSSPPS SSPSSPPS
SSPSSPPS                                 equ 0E22h
// bitfield definitions
SSPSSPPS_SSPSSPPS_POSN                   equ 0000h
SSPSSPPS_SSPSSPPS_POSITION               equ 0000h
SSPSSPPS_SSPSSPPS_SIZE                   equ 0005h
SSPSSPPS_SSPSSPPS_LENGTH                 equ 0005h
SSPSSPPS_SSPSSPPS_MASK                   equ 001Fh

// Register: RXPPS
#define RXPPS RXPPS
RXPPS                                    equ 0E24h
// bitfield definitions
RXPPS_RXPPS_POSN                         equ 0000h
RXPPS_RXPPS_POSITION                     equ 0000h
RXPPS_RXPPS_SIZE                         equ 0005h
RXPPS_RXPPS_LENGTH                       equ 0005h
RXPPS_RXPPS_MASK                         equ 001Fh

