GopalSaraf/Practicals/PSDL/include/proc/pic16f1709.inc
// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FEEh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FEFh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0007h
TOSH_TOSH_LENGTH                         equ 0007h
TOSH_TOSH_MASK                           equ 007Fh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ABDEN                            BANKMASK(BAUD1CON), 0
#define ABDOVF                           BANKMASK(BAUD1CON), 7
#define ACKDT                            BANKMASK(SSP1CON2), 5
#define ACKEN                            BANKMASK(SSP1CON2), 4
#define ACKSTAT                          BANKMASK(SSP1CON2), 6
#define ACKTIM                           BANKMASK(SSP1CON3), 7
#define ADD0                             BANKMASK(SSP1ADD), 0
#define ADD1                             BANKMASK(SSP1ADD), 1
#define ADD2                             BANKMASK(SSP1ADD), 2
#define ADD3                             BANKMASK(SSP1ADD), 3
#define ADD4                             BANKMASK(SSP1ADD), 4
#define ADD5                             BANKMASK(SSP1ADD), 5
#define ADD6                             BANKMASK(SSP1ADD), 6
#define ADD7                             BANKMASK(SSP1ADD), 7
#define ADDEN                            BANKMASK(RC1STA), 3
#define ADFM                             BANKMASK(ADCON1), 7
#define ADFVR0                           BANKMASK(FVRCON), 0
#define ADFVR1                           BANKMASK(FVRCON), 1
#define ADGO                             BANKMASK(ADCON0), 1
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADNREF                           BANKMASK(ADCON1), 2
#define ADON                             BANKMASK(ADCON0), 0
#define ADPREF0                          BANKMASK(ADCON1), 0
#define ADPREF1                          BANKMASK(ADCON1), 1
#define AHEN                             BANKMASK(SSP1CON3), 1
#define ANS5                             BANKMASK(ANSELA), 5
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSB4                            BANKMASK(ANSELB), 4
#define ANSB5                            BANKMASK(ANSELB), 5
#define ANSC0                            BANKMASK(ANSELC), 0
#define ANSC1                            BANKMASK(ANSELC), 1
#define ANSC2                            BANKMASK(ANSELC), 2
#define ANSC3                            BANKMASK(ANSELC), 3
#define ANSC6                            BANKMASK(ANSELC), 6
#define ANSC7                            BANKMASK(ANSELC), 7
#define BCL1IE                           BANKMASK(PIE2), 3
#define BCL1IF                           BANKMASK(PIR2), 3
#define BF                               BANKMASK(SSP1STAT), 0
#define BKA10                            BANKMASK(ICDBK0H), 2
#define BKA11                            BANKMASK(ICDBK0H), 3
#define BKA12                            BANKMASK(ICDBK0H), 4
#define BKA13                            BANKMASK(ICDBK0H), 5
#define BKA14                            BANKMASK(ICDBK0H), 6
#define BKA8                             BANKMASK(ICDBK0H), 0
#define BKA9                             BANKMASK(ICDBK0H), 1
#define BOEN                             BANKMASK(SSP1CON3), 4
#define BORFS                            BANKMASK(BORCON), 6
#define BORRDY                           BANKMASK(BORCON), 0
#define BRG16                            BANKMASK(BAUD1CON), 3
#define BRGH                             BANKMASK(TX1STA), 2
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define BUF0                             BANKMASK(SSP1BUF), 0
#define BUF1                             BANKMASK(SSP1BUF), 1
#define BUF2                             BANKMASK(SSP1BUF), 2
#define BUF3                             BANKMASK(SSP1BUF), 3
#define BUF4                             BANKMASK(SSP1BUF), 4
#define BUF5                             BANKMASK(SSP1BUF), 5
#define BUF6                             BANKMASK(SSP1BUF), 6
#define BUF7                             BANKMASK(SSP1BUF), 7
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE2), 5
#define C1IF                             BANKMASK(PIR2), 5
#define C1INTN                           BANKMASK(CM1CON1), 6
#define C1INTP                           BANKMASK(CM1CON1), 7
#define C1NCH0                           BANKMASK(CM1CON1), 0
#define C1NCH1                           BANKMASK(CM1CON1), 1
#define C1NCH2                           BANKMASK(CM1CON1), 2
#define C1ON                             BANKMASK(CM1CON0), 7
#define C1OUT                            BANKMASK(CM1CON0), 6
#define C1PCH0                           BANKMASK(CM1CON1), 3
#define C1PCH1                           BANKMASK(CM1CON1), 4
#define C1PCH2                           BANKMASK(CM1CON1), 5
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SP                             BANKMASK(CM1CON0), 2
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C1TSEL0                          BANKMASK(CCPTMRS), 0
#define C1TSEL1                          BANKMASK(CCPTMRS), 1
#define C1ZLF                            BANKMASK(CM1CON0), 3
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2IE                             BANKMASK(PIE2), 6
#define C2IF                             BANKMASK(PIR2), 6
#define C2INTN                           BANKMASK(CM2CON1), 6
#define C2INTP                           BANKMASK(CM2CON1), 7
#define C2NCH0                           BANKMASK(CM2CON1), 0
#define C2NCH1                           BANKMASK(CM2CON1), 1
#define C2NCH2                           BANKMASK(CM2CON1), 2
#define C2ON                             BANKMASK(CM2CON0), 7
#define C2OUT                            BANKMASK(CM2CON0), 6
#define C2PCH0                           BANKMASK(CM2CON1), 3
#define C2PCH1                           BANKMASK(CM2CON1), 4
#define C2PCH2                           BANKMASK(CM2CON1), 5
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SP                             BANKMASK(CM2CON0), 2
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define C2TSEL0                          BANKMASK(CCPTMRS), 2
#define C2TSEL1                          BANKMASK(CCPTMRS), 3
#define C2ZLF                            BANKMASK(CM2CON0), 3
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1IE                           BANKMASK(PIE1), 2
#define CCP1IF                           BANKMASK(PIR1), 2
#define CCP1M0                           BANKMASK(CCP1CON), 0
#define CCP1M1                           BANKMASK(CCP1CON), 1
#define CCP1M2                           BANKMASK(CCP1CON), 2
#define CCP1M3                           BANKMASK(CCP1CON), 3
#define CCP1X                            BANKMASK(CCP1CON), 5
#define CCP1Y                            BANKMASK(CCP1CON), 4
#define CCP2IE                           BANKMASK(PIE2), 0
#define CCP2IF                           BANKMASK(PIR2), 0
#define CCP2M0                           BANKMASK(CCP2CON), 0
#define CCP2M1                           BANKMASK(CCP2CON), 1
#define CCP2M2                           BANKMASK(CCP2CON), 2
#define CCP2M3                           BANKMASK(CCP2CON), 3
#define CCP2X                            BANKMASK(CCP2CON), 5
#define CCP2Y                            BANKMASK(CCP2CON), 4
#define CCPIE                            BANKMASK(PIE1), 2
#define CCPIF                            BANKMASK(PIR1), 2
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CFGS                             BANKMASK(PMCON1), 6
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CHS3                             BANKMASK(ADCON0), 5
#define CHS4                             BANKMASK(ADCON0), 6
#define CKE                              BANKMASK(SSP1STAT), 6
#define CKP                              BANKMASK(SSP1CON1), 4
#define CLC1IE                           BANKMASK(PIE3), 0
#define CLC1IF                           BANKMASK(PIR3), 0
#define CLC2IE                           BANKMASK(PIE3), 1
#define CLC2IF                           BANKMASK(PIR3), 1
#define CLC3IE                           BANKMASK(PIE3), 2
#define CLC3IF                           BANKMASK(PIR3), 2
#define COGIE                            BANKMASK(PIE3), 5
#define COGIF                            BANKMASK(PIR3), 5
#define CREN                             BANKMASK(RC1STA), 4
#define CSRC                             BANKMASK(TX1STA), 7
#define C_SHAD                           BANKMASK(STATUS_SHAD), 0
#define DAC1EN                           BANKMASK(DAC1CON0), 7
#define DAC1NSS                          BANKMASK(DAC1CON0), 0
#define DAC1OE1                          BANKMASK(DAC1CON0), 5
#define DAC1OE2                          BANKMASK(DAC1CON0), 4
#define DAC1PSS0                         BANKMASK(DAC1CON0), 2
#define DAC1PSS1                         BANKMASK(DAC1CON0), 3
#define DAC1R0                           BANKMASK(DAC1CON1), 0
#define DAC1R1                           BANKMASK(DAC1CON1), 1
#define DAC1R2                           BANKMASK(DAC1CON1), 2
#define DAC1R3                           BANKMASK(DAC1CON1), 3
#define DAC1R4                           BANKMASK(DAC1CON1), 4
#define DAC1R5                           BANKMASK(DAC1CON1), 5
#define DAC1R6                           BANKMASK(DAC1CON1), 6
#define DAC1R7                           BANKMASK(DAC1CON1), 7
#define DACEN                            BANKMASK(DAC1CON0), 7
#define DACNSS                           BANKMASK(DAC1CON0), 0
#define DACOE0                           BANKMASK(DAC1CON0), 4
#define DACOE1                           BANKMASK(DAC1CON0), 5
#define DACPSS0                          BANKMASK(DAC1CON0), 2
#define DACPSS1                          BANKMASK(DAC1CON0), 3
#define DACR0                            BANKMASK(DAC1CON1), 0
#define DACR1                            BANKMASK(DAC1CON1), 1
#define DACR2                            BANKMASK(DAC1CON1), 2
#define DACR3                            BANKMASK(DAC1CON1), 3
#define DACR4                            BANKMASK(DAC1CON1), 4
#define DACR5                            BANKMASK(DAC1CON1), 5
#define DACR6                            BANKMASK(DAC1CON1), 6
#define DACR7                            BANKMASK(DAC1CON1), 7
#define DC                               BANKMASK(STATUS), 1
#define DC1B0                            BANKMASK(CCP1CON), 4
#define DC1B1                            BANKMASK(CCP1CON), 5
#define DC2B0                            BANKMASK(CCP2CON), 4
#define DC2B1                            BANKMASK(CCP2CON), 5
#define DC_SHAD                          BANKMASK(STATUS_SHAD), 1
#define DHEN                             BANKMASK(SSP1CON3), 0
#define D_nA                             BANKMASK(SSP1STAT), 5
#define FERR                             BANKMASK(RC1STA), 2
#define FREE                             BANKMASK(PMCON1), 4
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRRDY                           BANKMASK(FVRCON), 6
#define G1ARSEN                          BANKMASK(COG1ASD0), 6
#define G1AS0E                           BANKMASK(COG1ASD1), 0
#define G1AS1E                           BANKMASK(COG1ASD1), 1
#define G1AS2E                           BANKMASK(COG1ASD1), 2
#define G1AS3E                           BANKMASK(COG1ASD1), 3
#define G1ASDAC0                         BANKMASK(COG1ASD0), 2
#define G1ASDAC1                         BANKMASK(COG1ASD0), 3
#define G1ASDBD0                         BANKMASK(COG1ASD0), 4
#define G1ASDBD1                         BANKMASK(COG1ASD0), 5
#define G1ASE                            BANKMASK(COG1ASD0), 7
#define G1BLKF0                          BANKMASK(COG1BLKF), 0
#define G1BLKF1                          BANKMASK(COG1BLKF), 1
#define G1BLKF2                          BANKMASK(COG1BLKF), 2
#define G1BLKF3                          BANKMASK(COG1BLKF), 3
#define G1BLKF4                          BANKMASK(COG1BLKF), 4
#define G1BLKF5                          BANKMASK(COG1BLKF), 5
#define G1BLKR0                          BANKMASK(COG1BLKR), 0
#define G1BLKR1                          BANKMASK(COG1BLKR), 1
#define G1BLKR2                          BANKMASK(COG1BLKR), 2
#define G1BLKR3                          BANKMASK(COG1BLKR), 3
#define G1BLKR4                          BANKMASK(COG1BLKR), 4
#define G1BLKR5                          BANKMASK(COG1BLKR), 5
#define G1CS0                            BANKMASK(COG1CON0), 3
#define G1CS1                            BANKMASK(COG1CON0), 4
#define G1DBF0                           BANKMASK(COG1DBF), 0
#define G1DBF1                           BANKMASK(COG1DBF), 1
#define G1DBF2                           BANKMASK(COG1DBF), 2
#define G1DBF3                           BANKMASK(COG1DBF), 3
#define G1DBF4                           BANKMASK(COG1DBF), 4
#define G1DBF5                           BANKMASK(COG1DBF), 5
#define G1DBR0                           BANKMASK(COG1DBR), 0
#define G1DBR1                           BANKMASK(COG1DBR), 1
#define G1DBR2                           BANKMASK(COG1DBR), 2
#define G1DBR3                           BANKMASK(COG1DBR), 3
#define G1DBR4                           BANKMASK(COG1DBR), 4
#define G1DBR5                           BANKMASK(COG1DBR), 5
#define G1EN                             BANKMASK(COG1CON0), 7
#define G1FDBS                           BANKMASK(COG1CON1), 6
#define G1FIS0                           BANKMASK(COG1FIS), 0
#define G1FIS1                           BANKMASK(COG1FIS), 1
#define G1FIS2                           BANKMASK(COG1FIS), 2
#define G1FIS3                           BANKMASK(COG1FIS), 3
#define G1FIS4                           BANKMASK(COG1FIS), 4
#define G1FIS5                           BANKMASK(COG1FIS), 5
#define G1FIS6                           BANKMASK(COG1FIS), 6
#define G1FSIM0                          BANKMASK(COG1FSIM), 0
#define G1FSIM1                          BANKMASK(COG1FSIM), 1
#define G1FSIM2                          BANKMASK(COG1FSIM), 2
#define G1FSIM3                          BANKMASK(COG1FSIM), 3
#define G1FSIM4                          BANKMASK(COG1FSIM), 4
#define G1FSIM5                          BANKMASK(COG1FSIM), 5
#define G1FSIM6                          BANKMASK(COG1FSIM), 6
#define G1LD                             BANKMASK(COG1CON0), 6
#define G1MD0                            BANKMASK(COG1CON0), 0
#define G1MD1                            BANKMASK(COG1CON0), 1
#define G1MD2                            BANKMASK(COG1CON0), 2
#define G1PHF0                           BANKMASK(COG1PHF), 0
#define G1PHF1                           BANKMASK(COG1PHF), 1
#define G1PHF2                           BANKMASK(COG1PHF), 2
#define G1PHF3                           BANKMASK(COG1PHF), 3
#define G1PHF4                           BANKMASK(COG1PHF), 4
#define G1PHF5                           BANKMASK(COG1PHF), 5
#define G1PHR0                           BANKMASK(COG1PHR), 0
#define G1PHR1                           BANKMASK(COG1PHR), 1
#define G1PHR2                           BANKMASK(COG1PHR), 2
#define G1PHR3                           BANKMASK(COG1PHR), 3
#define G1PHR4                           BANKMASK(COG1PHR), 4
#define G1PHR5                           BANKMASK(COG1PHR), 5
#define G1POLA                           BANKMASK(COG1CON1), 0
#define G1POLB                           BANKMASK(COG1CON1), 1
#define G1POLC                           BANKMASK(COG1CON1), 2
#define G1POLD                           BANKMASK(COG1CON1), 3
#define G1RDBS                           BANKMASK(COG1CON1), 7
#define G1RIS0                           BANKMASK(COG1RIS), 0
#define G1RIS1                           BANKMASK(COG1RIS), 1
#define G1RIS2                           BANKMASK(COG1RIS), 2
#define G1RIS3                           BANKMASK(COG1RIS), 3
#define G1RIS4                           BANKMASK(COG1RIS), 4
#define G1RIS5                           BANKMASK(COG1RIS), 5
#define G1RIS6                           BANKMASK(COG1RIS), 6
#define G1RSIM0                          BANKMASK(COG1RSIM), 0
#define G1RSIM1                          BANKMASK(COG1RSIM), 1
#define G1RSIM2                          BANKMASK(COG1RSIM), 2
#define G1RSIM3                          BANKMASK(COG1RSIM), 3
#define G1RSIM4                          BANKMASK(COG1RSIM), 4
#define G1RSIM5                          BANKMASK(COG1RSIM), 5
#define G1RSIM6                          BANKMASK(COG1RSIM), 6
#define G1SDATA                          BANKMASK(COG1STR), 4
#define G1SDATB                          BANKMASK(COG1STR), 5
#define G1SDATC                          BANKMASK(COG1STR), 6
#define G1SDATD                          BANKMASK(COG1STR), 7
#define G1STRA                           BANKMASK(COG1STR), 0
#define G1STRB                           BANKMASK(COG1STR), 1
#define G1STRC                           BANKMASK(COG1STR), 2
#define G1STRD                           BANKMASK(COG1STR), 3
#define GCEN                             BANKMASK(SSP1CON2), 7
#define GIE                              BANKMASK(INTCON), 7
#define GO                               BANKMASK(ADCON0), 1
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define HFIOFL                           BANKMASK(OSCSTAT), 3
#define HFIOFR                           BANKMASK(OSCSTAT), 4
#define HFIOFS                           BANKMASK(OSCSTAT), 0
#define INLVLA0                          BANKMASK(INLVLA), 0
#define INLVLA1                          BANKMASK(INLVLA), 1
#define INLVLA2                          BANKMASK(INLVLA), 2
#define INLVLA3                          BANKMASK(INLVLA), 3
#define INLVLA4                          BANKMASK(INLVLA), 4
#define INLVLA5                          BANKMASK(INLVLA), 5
#define INLVLB4                          BANKMASK(INLVLB), 4
#define INLVLB5                          BANKMASK(INLVLB), 5
#define INLVLB6                          BANKMASK(INLVLB), 6
#define INLVLB7                          BANKMASK(INLVLB), 7
#define INLVLC0                          BANKMASK(INLVLC), 0
#define INLVLC1                          BANKMASK(INLVLC), 1
#define INLVLC2                          BANKMASK(INLVLC), 2
#define INLVLC3                          BANKMASK(INLVLC), 3
#define INLVLC4                          BANKMASK(INLVLC), 4
#define INLVLC5                          BANKMASK(INLVLC), 5
#define INLVLC6                          BANKMASK(INLVLC), 6
#define INLVLC7                          BANKMASK(INLVLC), 7
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOCAF0                           BANKMASK(IOCAF), 0
#define IOCAF1                           BANKMASK(IOCAF), 1
#define IOCAF2                           BANKMASK(IOCAF), 2
#define IOCAF3                           BANKMASK(IOCAF), 3
#define IOCAF4                           BANKMASK(IOCAF), 4
#define IOCAF5                           BANKMASK(IOCAF), 5
#define IOCAN0                           BANKMASK(IOCAN), 0
#define IOCAN1                           BANKMASK(IOCAN), 1
#define IOCAN2                           BANKMASK(IOCAN), 2
#define IOCAN3                           BANKMASK(IOCAN), 3
#define IOCAN4                           BANKMASK(IOCAN), 4
#define IOCAN5                           BANKMASK(IOCAN), 5
#define IOCAP0                           BANKMASK(IOCAP), 0
#define IOCAP1                           BANKMASK(IOCAP), 1
#define IOCAP2                           BANKMASK(IOCAP), 2
#define IOCAP3                           BANKMASK(IOCAP), 3
#define IOCAP4                           BANKMASK(IOCAP), 4
#define IOCAP5                           BANKMASK(IOCAP), 5
#define IOCBF4                           BANKMASK(IOCBF), 4
#define IOCBF5                           BANKMASK(IOCBF), 5
#define IOCBF6                           BANKMASK(IOCBF), 6
#define IOCBF7                           BANKMASK(IOCBF), 7
#define IOCBN4                           BANKMASK(IOCBN), 4
#define IOCBN5                           BANKMASK(IOCBN), 5
#define IOCBN6                           BANKMASK(IOCBN), 6
#define IOCBN7                           BANKMASK(IOCBN), 7
#define IOCBP4                           BANKMASK(IOCBP), 4
#define IOCBP5                           BANKMASK(IOCBP), 5
#define IOCBP6                           BANKMASK(IOCBP), 6
#define IOCBP7                           BANKMASK(IOCBP), 7
#define IOCCF0                           BANKMASK(IOCCF), 0
#define IOCCF1                           BANKMASK(IOCCF), 1
#define IOCCF2                           BANKMASK(IOCCF), 2
#define IOCCF3                           BANKMASK(IOCCF), 3
#define IOCCF4                           BANKMASK(IOCCF), 4
#define IOCCF5                           BANKMASK(IOCCF), 5
#define IOCCF6                           BANKMASK(IOCCF), 6
#define IOCCF7                           BANKMASK(IOCCF), 7
#define IOCCN0                           BANKMASK(IOCCN), 0
#define IOCCN1                           BANKMASK(IOCCN), 1
#define IOCCN2                           BANKMASK(IOCCN), 2
#define IOCCN3                           BANKMASK(IOCCN), 3
#define IOCCN4                           BANKMASK(IOCCN), 4
#define IOCCN5                           BANKMASK(IOCCN), 5
#define IOCCN6                           BANKMASK(IOCCN), 6
#define IOCCN7                           BANKMASK(IOCCN), 7
#define IOCCP0                           BANKMASK(IOCCP), 0
#define IOCCP1                           BANKMASK(IOCCP), 1
#define IOCCP2                           BANKMASK(IOCCP), 2
#define IOCCP3                           BANKMASK(IOCCP), 3
#define IOCCP4                           BANKMASK(IOCCP), 4
#define IOCCP5                           BANKMASK(IOCCP), 5
#define IOCCP6                           BANKMASK(IOCCP), 6
#define IOCCP7                           BANKMASK(IOCCP), 7
#define IOCIE                            BANKMASK(INTCON), 3
#define IOCIF                            BANKMASK(INTCON), 0
#define IRCF0                            BANKMASK(OSCCON), 3
#define IRCF1                            BANKMASK(OSCCON), 4
#define IRCF2                            BANKMASK(OSCCON), 5
#define IRCF3                            BANKMASK(OSCCON), 6
#define LATA0                            BANKMASK(LATA), 0
#define LATA1                            BANKMASK(LATA), 1
#define LATA2                            BANKMASK(LATA), 2
#define LATA4                            BANKMASK(LATA), 4
#define LATA5                            BANKMASK(LATA), 5
#define LATB4                            BANKMASK(LATB), 4
#define LATB5                            BANKMASK(LATB), 5
